angular.module("app.services",[])
.factory("articleFac",function(){
  return {
    get:function(){
      return [{
        title:"每天写1000字",
        introduce:"玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。 投稿必须原创。如果发现有非..",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"程序员",
        introduce:"如果你是程序员，或者有一颗喜欢写程序的心，喜欢分享技术干货、项目经验、程序员日常囧事等等，欢迎投稿《程序员》专题。 专题主编：小彤花园 http://www.jianshu.com/use...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"诗",
        introduce:"诗，让你感受自己的心灵。 专题主编：苏锦年 投稿须知： 1.本专题收录古诗、词、现代诗以及诗词点评及指导。 2.内容必须为原创，切勿用其他诗人的诗句。 3.文章排版整洁，注意...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"一直写到老的故事",
        introduce:"人类善于学习. 所以学的姿势越来越多. 但我们不是只有肉体. 我们还有灵魂需要修行. 而『阅读』,就是我们磨砺自身的武器。如果还想看更多优质文章请关注公众号：一直写到老的故事。 拒稿原因如下：...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"我想到的爱情是什么样子？",
        introduce:"爱情这个似懂非懂似有似无，不舍的放弃却也不清楚是否拥有，不是暧昧不清，不是朝夕相处，是什么？相伴相依🍒只温暖你【关注微信公众号：会说话的猫（头像与简书上一致）】简书上未通过的投稿，会在微信平台上推送",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"最后，TA们没有在一起",
        introduce:"ta们开心就好",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"好姑娘要光芒万丈",
        introduce:"专题官方微博开通，扫一扫二维码即可关注http://www.jianshu.com/p/bfe188a39c46 好姑娘交流群请添加微信 yeqinglan623 姊妹专题《好姑娘，坏...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"一直写到老的故事",
        introduce:"人类善于学习. 所以学的姿势越来越多. 但我们不是只有肉体. 我们还有灵魂需要修行. 而『阅读』,就是我们磨砺自身的武器。如果还想看更多优质文章请关注公众号：一直写到老的故事。 拒稿原因如下：...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"一直写到老的故事",
        introduce:"人类善于学习. 所以学的姿势越来越多. 但我们不是只有肉体. 我们还有灵魂需要修行. 而『阅读』,就是我们磨砺自身的武器。如果还想看更多优质文章请关注公众号：一直写到老的故事。 拒稿原因如下：...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"一直写到老的故事",
        introduce:"人类善于学习. 所以学的姿势越来越多. 但我们不是只有肉体. 我们还有灵魂需要修行. 而『阅读』,就是我们磨砺自身的武器。如果还想看更多优质文章请关注公众号：一直写到老的故事。 拒稿原因如下：...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      }]
    }
  }
})
.factory("projectFac",function(){
  return {
    get:function(){
      return [{
        title:"每天写1000字",
        introduce:"玩转简书的第一步，从这个专题开始。 想上首页热门榜么？好内容想被更多人看到么？来投稿吧！如果被拒也不要灰心哦～入选文章会进一个队列挨个上首页，请耐心等待。 投稿必须原创。如果发现有非..",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"程序员",
        introduce:"如果你是程序员，或者有一颗喜欢写程序的心，喜欢分享技术干货、项目经验、程序员日常囧事等等，欢迎投稿《程序员》专题。 专题主编：小彤花园 http://www.jianshu.com/use...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"诗",
        introduce:"诗，让你感受自己的心灵。 专题主编：苏锦年 投稿须知： 1.本专题收录古诗、词、现代诗以及诗词点评及指导。 2.内容必须为原创，切勿用其他诗人的诗句。 3.文章排版整洁，注意...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"一直写到老的故事",
        introduce:"人类善于学习. 所以学的姿势越来越多. 但我们不是只有肉体. 我们还有灵魂需要修行. 而『阅读』,就是我们磨砺自身的武器。如果还想看更多优质文章请关注公众号：一直写到老的故事。 拒稿原因如下：...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"我想到的爱情是什么样子？",
        introduce:"爱情这个似懂非懂似有似无，不舍的放弃却也不清楚是否拥有，不是暧昧不清，不是朝夕相处，是什么？相伴相依🍒只温暖你【关注微信公众号：会说话的猫（头像与简书上一致）】简书上未通过的投稿，会在微信平台上推送",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"最后，TA们没有在一起",
        introduce:"ta们开心就好",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"好姑娘要光芒万丈",
        introduce:"专题官方微博开通，扫一扫二维码即可关注http://www.jianshu.com/p/bfe188a39c46 好姑娘交流群请添加微信 yeqinglan623 姊妹专题《好姑娘，坏...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"一直写到老的故事",
        introduce:"人类善于学习. 所以学的姿势越来越多. 但我们不是只有肉体. 我们还有灵魂需要修行. 而『阅读』,就是我们磨砺自身的武器。如果还想看更多优质文章请关注公众号：一直写到老的故事。 拒稿原因如下：...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"一直写到老的故事",
        introduce:"人类善于学习. 所以学的姿势越来越多. 但我们不是只有肉体. 我们还有灵魂需要修行. 而『阅读』,就是我们磨砺自身的武器。如果还想看更多优质文章请关注公众号：一直写到老的故事。 拒稿原因如下：...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      },{
        title:"一直写到老的故事",
        introduce:"人类善于学习. 所以学的姿势越来越多. 但我们不是只有肉体. 我们还有灵魂需要修行. 而『阅读』,就是我们磨砺自身的武器。如果还想看更多优质文章请关注公众号：一直写到老的故事。 拒稿原因如下：...",
        type:0,
        time:"2016-05-24 12:32:32",
        collection:64,
        read:245
      }]
    }
  }
})